# 這是專門存放修繕資料的檔案
REPAIR_DATABASE = {
    "偵測器": ["添購偵煙器"],
    "滅火器": ["添購滅火器","原有滅火器過期，故換新"],
    "電視": [
        "電視因機板短路無法開啟，故請廠商進行修繕",
        "電視顯示畫面異常，故請廠商進行修繕",
        "電視無法顯示畫面，因缺乏零件維修，故換新",
        "電視主機板損壞，經師傅評估後無法修繕，故換新",
        "電視面板故障，無法顯示畫面，經師傅評估後無法修繕，故換新"
    ],
    "冷氣": [
        "冷氣無法使用，經師傅評估為內部髒污堆積導致無法送風，故請廠商進行修繕工程",
        "冷氣無法運轉，經檢查後為冷氣機板故障，故進行修繕",
        "冷氣不冷，經師傅檢查後為室外機壓縮機故障，故進行修繕",
        "冷氣製冷效果差，經檢查後為銅管裂動，造成冷媒外洩，故進行修繕",
        "冷氣啟動時有異音，經檢查後為內部軸承磨損，故進行修繕",
        "冷氣漏水，經師傅評估為排水器故障無法修復，故換新冷氣排水器",
        "冷氣室外機壓縮機爆裂，無法修復，故換新",
        "冷氣無法啟動，經師傅評估為內部線路燒毀無法修復，故換新冷氣",
        "窗型冷氣無法啟動，經師傅評估為內部線路燒毀無法修復，改換新分離式冷氣"
    ],
    "冰箱": [
        "冰箱控制頁板異常，故進行修繕",
        "冰箱不冷，經師傅檢查後為冷媒系統異常，故進行修繕",
        "冰箱發出異音，經檢查後為內部零件損壞無法修復，故換新",
        "冰箱壓縮機故障，經師傅評估無法修復，故換新冰箱"
    ],
    "熱水器": [
        "換修為強制排氣熱水器",
        "增設強制排氣熱水器",
        "熱水器無法點火，經師傅評估為內部鏽蝕，故請師傅進行排修",
        "熱水器水盤皮破裂，故請師傅進行維修",
        "熱水器微動開關故障，故請師傅進行維修",
        "電熱水器加熱管損壞，導致無法加熱，故進行修繕",
        "熱水器無法正常加熱，師傅評估無零件可供維修，故換新",
        "熱水器無法點火，經師傅評估為內部零件損壞導致無法修復，故換新熱水器",
        "電熱水器線路損壞，無法修復，故換新",
        "電熱水器內膽漏水，師傅評估後建議換新"
    ],
    "洗衣機": [
        "洗衣機控制面板故障，故請師傅進行修繕",
        "洗衣機無法運轉，經師傅評估為內部髒污堵塞，故請廠商進行修繕",
        "洗衣機無法排水，經檢查後為排水泵損壞，故進行維修",
        "洗衣機無法運轉，經評估後缺乏零件維修，故換新",
        "洗衣機轉軸斷裂，經師傅評估無法修復，故換新洗衣機"
    ],
    "排油煙機": [
        "排油煙機無法啟動，經查為線路問題，故進行修繕",
        "排油煙機轉軸斷裂，經師傅評估無法修復，故換新排油煙機",
        "排油煙機馬達卡死無法運作，經評估無法修復，故換新"
    ],
    "瓦斯爐": [
        "瓦斯爐點火時有異音，經檢查後為內部零件損壞，無零件可維修，故換新",
        "瓦斯爐無法點火，經師傅評估為內部鏽蝕導致無法修復，故換新瓦斯爐"
    ],
    "門/門鎖": [
        "房間門框變形導致不好開關，故進行修繕",
        "房間門脫膠導致不好開關，故進行修繕",
        "門把斷裂無法使用，故進行修繕",
        "紗門無法密合，故進行修繕",
        "木門因受潮變形無法正常開合，經師傅評估無法修復，改換新門",
        "門因氧化而脆裂，經師傅評估無法修復，改換新門",
        "門片生鏽，經師傅評估無法修復，故換新門",
        "門鎖圓鎖生鏽導致無法開關，經師傅評估無法修復，改換新門鎖",
        "門鎖鎖芯卡死，經評估無法修復，故換常子鎖",
        "電子門鎖因電池漏液及內部線路鏽蝕導致機體損壞，故進行換修"
    ],
    "窗": [
        "紗窗破損，故進行維修",
        "窗框變形導致不好開關，故進行修繕"
    ],
    "照明設備": [
        "崁燈損壞，故進行更換",
        "燈座線路損壞，無同型零件可供維修，故換新燈座"
    ],
    "衛生設備": [
        "淋浴宣瓷器破裂，有安全疑慮，經師傅評估請更換新面盆",
        "宜盆落水頭損壞導致排水問題，故進行維修",
        "馬桶水箱漏水，經師傅檢查為止水皮老化變形，故進行修繕",
        "馬桶無法正常進水，請師傅更換水箱內部零件",
        "馬桶有裂縫，經師傅評估無法修復，故換新馬桶",
        "馬桶進水管線漏水，故請師傅進行修繕",
        "馬桶漏水，經師傅評估無法修復，故換新馬桶",
        "馬桶堵塞無法使用，故請師傅進行通管工程",
        "浴缸漏水，故請師傅進行修繕工程",
        "浴缸漏水嚴重無法修復，故拆除浴缸設備"
    ],
    "防水工程": [
        "因天花板滲漏水，故施作防水工程",
        "因牆壁壁癌滲漏水，故施作防水工程",
        "因天花板及牆壁滲漏水，故請師傅進行防水工程",
        "因浴室地板漏水，故請師傅進行防水工程"
    ],
    "水管線": [
        "排水管線堵塞，故請師傅進行疏通工程",
        "浴室糞管排水管漏水，故請師傅進行修繕",
        "馬桶排水管線漏水，故請師傅進行修繕",
        "廚房水槽軟管漏水，故請師傅進行修繕",
        "水管老化導致漏水，故請師傅進行修繕"
    ]
}